In [88]:
import pandas as pd
import datetime as dt
from pandas_datareader import data

In [32]:
dt.date(2010,1,20) # YYYY MM DD HH MM SS

datetime.date(2010, 1, 20)

In [33]:
dates=[dt.date(2016,2,1),dt.date(2018,5,14),dt.date(2020,5,29)]

In [34]:
d=["2016/02/01","2018/05/14","2020/5/29"]
pd.DatetimeIndex(d)

DatetimeIndex(['2016-02-01', '2018-05-14', '2020-05-29'], dtype='datetime64[ns]', freq=None)

In [35]:
pd.Timestamp("2016/03/05")

Timestamp('2016-03-05 00:00:00')

In [36]:
pd.to_datetime(["2015-01-03","2014/02/08","2016","4th July,1994"])

DatetimeIndex(['2015-01-03', '2014-02-08', '2016-01-01', '1994-07-04'], dtype='datetime64[ns]', freq=None)

In [37]:
pd.to_datetime(dates,errors="coerce") #coerce stores non datetimeelements as NaT (Not Date Time)

DatetimeIndex(['2016-02-01', '2018-05-14', '2020-05-29'], dtype='datetime64[ns]', freq=None)

In [38]:
pd.date_range(start="2012-09-09",periods=50,freq="D") # D means One Day 6D means 6 Days

DatetimeIndex(['2012-09-09', '2012-09-10', '2012-09-11', '2012-09-12',
               '2012-09-13', '2012-09-14', '2012-09-15', '2012-09-16',
               '2012-09-17', '2012-09-18', '2012-09-19', '2012-09-20',
               '2012-09-21', '2012-09-22', '2012-09-23', '2012-09-24',
               '2012-09-25', '2012-09-26', '2012-09-27', '2012-09-28',
               '2012-09-29', '2012-09-30', '2012-10-01', '2012-10-02',
               '2012-10-03', '2012-10-04', '2012-10-05', '2012-10-06',
               '2012-10-07', '2012-10-08', '2012-10-09', '2012-10-10',
               '2012-10-11', '2012-10-12', '2012-10-13', '2012-10-14',
               '2012-10-15', '2012-10-16', '2012-10-17', '2012-10-18',
               '2012-10-19', '2012-10-20', '2012-10-21', '2012-10-22',
               '2012-10-23', '2012-10-24', '2012-10-25', '2012-10-26',
               '2012-10-27', '2012-10-28'],
              dtype='datetime64[ns]', freq='D')

In [39]:
pd.date_range(start="2012-09-09",periods=50,freq="B") #Business Week

DatetimeIndex(['2012-09-10', '2012-09-11', '2012-09-12', '2012-09-13',
               '2012-09-14', '2012-09-17', '2012-09-18', '2012-09-19',
               '2012-09-20', '2012-09-21', '2012-09-24', '2012-09-25',
               '2012-09-26', '2012-09-27', '2012-09-28', '2012-10-01',
               '2012-10-02', '2012-10-03', '2012-10-04', '2012-10-05',
               '2012-10-08', '2012-10-09', '2012-10-10', '2012-10-11',
               '2012-10-12', '2012-10-15', '2012-10-16', '2012-10-17',
               '2012-10-18', '2012-10-19', '2012-10-22', '2012-10-23',
               '2012-10-24', '2012-10-25', '2012-10-26', '2012-10-29',
               '2012-10-30', '2012-10-31', '2012-11-01', '2012-11-02',
               '2012-11-05', '2012-11-06', '2012-11-07', '2012-11-08',
               '2012-11-09', '2012-11-12', '2012-11-13', '2012-11-14',
               '2012-11-15', '2012-11-16'],
              dtype='datetime64[ns]', freq='B')

In [40]:
pd.date_range(end="1999-12-31",periods=50,freq="W")

DatetimeIndex(['1999-01-17', '1999-01-24', '1999-01-31', '1999-02-07',
               '1999-02-14', '1999-02-21', '1999-02-28', '1999-03-07',
               '1999-03-14', '1999-03-21', '1999-03-28', '1999-04-04',
               '1999-04-11', '1999-04-18', '1999-04-25', '1999-05-02',
               '1999-05-09', '1999-05-16', '1999-05-23', '1999-05-30',
               '1999-06-06', '1999-06-13', '1999-06-20', '1999-06-27',
               '1999-07-04', '1999-07-11', '1999-07-18', '1999-07-25',
               '1999-08-01', '1999-08-08', '1999-08-15', '1999-08-22',
               '1999-08-29', '1999-09-05', '1999-09-12', '1999-09-19',
               '1999-09-26', '1999-10-03', '1999-10-10', '1999-10-17',
               '1999-10-24', '1999-10-31', '1999-11-07', '1999-11-14',
               '1999-11-21', '1999-11-28', '1999-12-05', '1999-12-12',
               '1999-12-19', '1999-12-26'],
              dtype='datetime64[ns]', freq='W-SUN')

In [41]:
bunch=pd.date_range(start="2000-01-01",end="2010-12-31",freq="24D")

In [42]:
s=pd.Series(bunch)

In [43]:
s.dt.day
s.dt.month

0       1
1       1
2       2
3       3
4       4
       ..
163     9
164    10
165    11
166    11
167    12
Length: 168, dtype: int64

In [44]:
s[s.dt.is_quarter_start]

0     2000-01-01
19    2001-04-01
38    2002-07-01
137   2009-01-01
dtype: datetime64[ns]

In [45]:
s[s.dt.is_month_start]

0     2000-01-01
19    2001-04-01
38    2002-07-01
104   2006-11-01
109   2007-03-01
137   2009-01-01
142   2009-05-01
dtype: datetime64[ns]

In [46]:
s[s.dt.is_quarter_end]

57   2003-09-30
dtype: datetime64[ns]

In [49]:
c="MSFT"
i ="2010-1-1"
o="2020-5-14"
stocks=data.DataReader(name=c,data_source="yahoo",start=i,end=o)
stocks

,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,
2010-01-04,31.100000,30.590000,30.620001,30.950001,38409100.0,24.294369
2010-01-05,31.100000,30.639999,30.850000,30.959999,49749600.0,24.302216
2010-01-06,31.080000,30.520000,30.879999,30.770000,58182400.0,24.153070
2010-01-07,30.700001,30.190001,30.629999,30.450001,50559700.0,23.901886
2010-01-08,30.879999,30.240000,30.280001,30.660000,51197400.0,24.066734
...,...,...,...,...,...,...
2020-05-07,184.550003,182.580002,184.169998,183.600006,28316000.0,183.600006
2020-05-08,185.000000,183.360001,184.979996,184.679993,30912600.0,184.679993
2020-05-11,187.509995,182.850006,183.149994,186.740005,30809400.0,186.740005
2020-05-12,187.039993,182.300003,186.800003,182.509995,32038200.0,182.509995
2020-05-13,184.050003,176.539993,182.550003,179.750000,44650800.0,179.750000

In [57]:
stocks.values
stocks.columns
stocks.index[300]
stocks.loc["2014-03-04"]

High         3.848000e+01
Low          3.807000e+01
Open         3.820000e+01
Close        3.841000e+01
Volume       2.680240e+07
Adj Close    3.372342e+01
Name: 2014-03-04 00:00:00, dtype: float64

In [67]:
b=pd.date_range(start="1991-04-12",end="2017-12-31",freq=pd.DateOffset(years=1))
b

DatetimeIndex(['1991-04-12', '1992-04-12', '1993-04-12', '1994-04-12',
               '1995-04-12', '1996-04-12', '1997-04-12', '1998-04-12',
               '1999-04-12', '2000-04-12', '2001-04-12', '2002-04-12',
               '2003-04-12', '2004-04-12', '2005-04-12', '2006-04-12',
               '2007-04-12', '2008-04-12', '2009-04-12', '2010-04-12',
               '2011-04-12', '2012-04-12', '2013-04-12', '2014-04-12',
               '2015-04-12', '2016-04-12', '2017-04-12'],
              dtype='datetime64[ns]', freq='<DateOffset: years=1>')

In [68]:
stocks[stocks.index.isin(b)]

                 High        Low       Open      Close      Volume  Adj Close
Date
2010-04-12  30.490000  30.209999  30.250000  30.320000  37068800.0  23.911137
2011-04-12  25.850000  25.549999  25.830000  25.639999  36920400.0  20.666864
2012-04-12  31.040001  30.420000  30.480000  30.980000  38304000.0  25.651670
2013-04-12  29.020000  28.660000  28.850000  28.790001  62886300.0  24.553804
2016-04-12  54.779999  53.759998  54.369999  54.650002  24944300.0  50.621754
2017-04-12  65.510002  65.110001  65.419998  65.230003  17108500.0  62.011013

In [70]:
stocks.insert(1,"Is Start of Month",stocks.index.is_month_start)

ValueError: cannot insert Is Start of Month, already exists

In [71]:
stocks

,High,Is Start of Month,Low,Open,Close,Volume,Adj Close
Date,,,,,,,
2010-01-04,31.100000,False,30.590000,30.620001,30.950001,38409100.0,24.294369
2010-01-05,31.100000,False,30.639999,30.850000,30.959999,49749600.0,24.302216
2010-01-06,31.080000,False,30.520000,30.879999,30.770000,58182400.0,24.153070
2010-01-07,30.700001,False,30.190001,30.629999,30.450001,50559700.0,23.901886
2010-01-08,30.879999,False,30.240000,30.280001,30.660000,51197400.0,24.066734
...,...,...,...,...,...,...,...
2020-05-07,184.550003,False,182.580002,184.169998,183.600006,28316000.0,183.600006
2020-05-08,185.000000,False,183.360001,184.979996,184.679993,30912600.0,184.679993
2020-05-11,187.509995,False,182.850006,183.149994,186.740005,30809400.0,186.740005
2020-05-12,187.039993,False,182.300003,186.800003,182.509995,32038200.0,182.509995
2020-05-13,184.050003,False,176.539993,182.550003,179.750000,44650800.0,179.750000

In [72]:
stocks.truncate(before="2012-06-07", after="2014-05-15")

,High,Is Start of Month,Low,Open,Close,Volume,Adj Close
Date,,,,,,,
2012-06-07,29.700001,False,29.170000,29.639999,29.230000,37792800.0,24.361462
2012-06-08,29.680000,False,29.049999,29.209999,29.650000,42551100.0,24.711512
2012-06-11,29.809999,False,28.820000,29.730000,28.900000,46361900.0,24.086430
2012-06-12,29.299999,False,28.840000,29.100000,29.290001,35337900.0,24.411472
2012-06-13,29.440001,False,29.049999,29.219999,29.129999,32984600.0,24.278118
...,...,...,...,...,...,...,...
2014-05-09,39.849998,False,39.369999,39.540001,39.540001,29647600.0,34.715530
2014-05-12,40.020000,False,39.650002,39.740002,39.970001,22782600.0,35.093067
2014-05-13,40.500000,False,39.849998,39.919998,40.419998,27004800.0,35.738518
2014-05-14,40.450001,False,40.049999,40.299999,40.240002,18818700.0,35.579372
2014-05-15,40.400002,False,39.509998,40.090000,39.599998,37793200.0,35.013496

In [74]:
st=data.DataReader("GOOG",data_source="yahoo",start=dt.date(2000,1,1),end=dt.datetime.now())
st.head(3)

                 High        Low       Open      Close      Volume  Adj Close
Date
2004-08-19  51.835709  47.800831  49.813286  49.982655  44871300.0  49.982655
2004-08-20  54.336334  50.062355  50.316402  53.952770  22942800.0  53.952770
2004-08-23  56.528118  54.321388  55.168217  54.495735  18342800.0  54.495735

In [81]:
st.index + pd.DateOffset(weeks=2) # moves access 2 weeks

DatetimeIndex(['2004-09-02', '2004-09-03', '2004-09-06', '2004-09-07',
               '2004-09-08', '2004-09-09', '2004-09-10', '2004-09-13',
               '2004-09-14', '2004-09-15',
               ...
               '2020-05-14', '2020-05-15', '2020-05-18', '2020-05-19',
               '2020-05-20', '2020-05-21', '2020-05-22', '2020-05-25',
               '2020-05-26', '2020-05-27'],
              dtype='datetime64[ns]', name='Date', length=3961, freq=None)

In [83]:
st.index - pd.tseries.offsets.MonthEnd()

DatetimeIndex(['2004-07-31', '2004-07-31', '2004-07-31', '2004-07-31',
               '2004-07-31', '2004-07-31', '2004-07-31', '2004-07-31',
               '2004-07-31', '2004-08-31',
               ...
               '2020-03-31', '2020-04-30', '2020-04-30', '2020-04-30',
               '2020-04-30', '2020-04-30', '2020-04-30', '2020-04-30',
               '2020-04-30', '2020-04-30'],
              dtype='datetime64[ns]', name='Date', length=3961, freq=None)

In [91]:
tA=pd.Timestamp("2016-03-31")
tB=pd.Timestamp("2016-04-21")
tB-tA

Timedelta('21 days 00:00:00')

In [94]:
sh=pd.read_csv("ecommerce.csv",parse_dates=["order_date","delivery_date"],index_col="ID")
sh

    order_date delivery_date
ID
1   1998-05-24    1999-02-05
2   1992-04-22    1998-03-06
4   1991-02-10    1992-08-26
5   1992-07-21    1997-11-20
7   1993-09-02    1998-06-10
..         ...           ...
990 1991-06-24    1996-02-02
991 1991-09-09    1998-03-30
993 1990-11-16    1998-04-27
994 1993-06-03    1993-06-13
997 1990-01-04    1991-10-03

[501 rows x 2 columns]

In [95]:
sh["delivery_time"]=sh["delivery_date"] - sh["order_date"]
sh

    order_date delivery_date delivery_time
ID
1   1998-05-24    1999-02-05      257 days
2   1992-04-22    1998-03-06     2144 days
4   1991-02-10    1992-08-26      563 days
5   1992-07-21    1997-11-20     1948 days
7   1993-09-02    1998-06-10     1742 days
..         ...           ...           ...
990 1991-06-24    1996-02-02     1684 days
991 1991-09-09    1998-03-30     2394 days
993 1990-11-16    1998-04-27     2719 days
994 1993-06-03    1993-06-13       10 days
997 1990-01-04    1991-10-03      637 days

[501 rows x 3 columns]

In [96]:
sh[sh["delivery_time"]> "365 days"]

    order_date delivery_date delivery_time
ID
2   1992-04-22    1998-03-06     2144 days
4   1991-02-10    1992-08-26      563 days
5   1992-07-21    1997-11-20     1948 days
7   1993-09-02    1998-06-10     1742 days
9   1990-01-25    1994-10-02     1711 days
..         ...           ...           ...
986 1990-12-10    1992-12-16      737 days
990 1991-06-24    1996-02-02     1684 days
991 1991-09-09    1998-03-30     2394 days
993 1990-11-16    1998-04-27     2719 days
997 1990-01-04    1991-10-03      637 days

[394 rows x 3 columns]